---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
EdgeEndPoint..::..Equals Method
EdgeEndPoint Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Equals(Object) | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
|  | Equals(EdgeEndPoint) | Determines whether this EdgeEndPoint is equal to another. |

# See Also

EdgeEndPoint Class

EdgeEndPoint Members

Autodesk.Revit.DB Namespace